
#### Terraform Format and Style 🖌  : `success`
#### Terraform Initialization ⚙ : `success`
#### Terraform Plan 📖 : `success`

<details><summary>Show Plan</summary>

``````module.s3.module.isbabymaciocehereyet.aws_s3_bucket.website_root: Refreshing state... [id=isbabymaciocehereyet.com-root]
module.s3.aws_route53_zone.baby-macioce: Refreshing state... [id=Z04297862RMBF7HTXKRLG]
module.s3.module.links-nickmacioce.aws_acm_certificate.wildcard_website: Refreshing state... [id=arn:aws:acm:us-east-1:153542816638:certificate/32e2ff15-f95f-4a15-91f4-4ab8cca0c89d]
module.s3.module.links-nickmacioce.aws_s3_bucket.website_root: Refreshing state... [id=links.nickmacioce.com-root]
module.s3.aws_route53_zone.nickmacioce: Refreshing state... [id=Z0408742MN1DB2L1IVKL]
module.networking.aws_vpc.main: Refreshing state... [id=vpc-0b89592ea7423cf94]
module.s3.module.nickmacioce.aws_acm_certificate.wildcard_website: Refreshing state... [id=arn:aws:acm:us-east-1:153542816638:certificate/4e70f32a-ff67-4d20-a20a-d9acf9c6e1da]
module.s3.module.isbabymaciocehereyet.aws_acm_certificate.wildcard_website: Refreshing state... [id=arn:aws:acm:us-east-1:153542816638:certificate/74685574-5ab8-4b78-af76-9b9e1e2b5444]
module.s3.module.nickmacioce.aws_s3_bucket.website_root: Refreshing state... [id=nickmacioce.com-root]
module.cloudfront.aws_cloudfront_origin_access_identity.nickmacioce-oai: Refreshing state... [id=E13B67DH4T3QW9]
module.s3.module.links-nickmacioce.aws_route53_record.wildcard_validation["*.links.nickmacioce.com"]: Refreshing state... [id=Z0408742MN1DB2L1IVKL__d501e5c61d85996ce4395a16dfc2859e.links.nickmacioce.com._CNAME]
module.s3.module.links-nickmacioce.aws_route53_record.wildcard_validation["links.nickmacioce.com"]: Refreshing state... [id=Z0408742MN1DB2L1IVKL__d501e5c61d85996ce4395a16dfc2859e.links.nickmacioce.com._CNAME]
module.s3.module.nickmacioce.aws_route53_record.wildcard_validation["nickmacioce.com"]: Refreshing state... [id=Z0408742MN1DB2L1IVKL__16b994c0d16039e5552bba8bdc404476.nickmacioce.com._CNAME]
module.s3.module.nickmacioce.aws_route53_record.wildcard_validation["*.nickmacioce.com"]: Refreshing state... [id=Z0408742MN1DB2L1IVKL__16b994c0d16039e5552bba8bdc404476.nickmacioce.com._CNAME]
module.s3.module.isbabymaciocehereyet.aws_route53_record.wildcard_validation["*.isbabymaciocehereyet.com"]: Refreshing state... [id=Z04297862RMBF7HTXKRLG__3a5e9f534e0cc1514e2261d4e69fa372.isbabymaciocehereyet.com._CNAME]
module.s3.module.isbabymaciocehereyet.aws_route53_record.wildcard_validation["isbabymaciocehereyet.com"]: Refreshing state... [id=Z04297862RMBF7HTXKRLG__3a5e9f534e0cc1514e2261d4e69fa372.isbabymaciocehereyet.com._CNAME]
module.s3.module.nickmacioce.aws_acm_certificate_validation.wildcard_cert: Refreshing state... [id=2021-08-15 04:44:14 +0000 UTC]
module.s3.module.links-nickmacioce.aws_acm_certificate_validation.wildcard_cert: Refreshing state... [id=2021-08-15 04:44:20 +0000 UTC]
module.s3.module.isbabymaciocehereyet.aws_acm_certificate_validation.wildcard_cert: Refreshing state... [id=2021-08-15 04:44:12 +0000 UTC]
module.networking.aws_default_security_group.default: Refreshing state... [id=sg-0609d753e3b35a22f]
module.networking.aws_subnet.private_subnet_1: Refreshing state... [id=subnet-01b751997de387cd5]
module.networking.aws_subnet.public_subnet_1: Refreshing state... [id=subnet-097774274a64c6abd]
module.s3.module.links-nickmacioce.aws_s3_bucket_policy.oai-policy: Refreshing state... [id=links.nickmacioce.com-root]
module.s3.module.links-nickmacioce.aws_s3_bucket_public_access_block.access_good_1: Refreshing state... [id=links.nickmacioce.com-root]
module.s3.module.isbabymaciocehereyet.aws_s3_bucket_public_access_block.access_good_1: Refreshing state... [id=isbabymaciocehereyet.com-root]
module.s3.module.isbabymaciocehereyet.aws_s3_bucket_policy.oai-policy: Refreshing state... [id=isbabymaciocehereyet.com-root]
module.s3.module.isbabymaciocehereyet.aws_cloudfront_distribution.website_cdn_root: Refreshing state... [id=EKU74NXRQDNYF]
module.s3.module.links-nickmacioce.aws_cloudfront_distribution.website_cdn_root: Refreshing state... [id=E1XIU9LHYXL6GI]
module.s3.module.nickmacioce.aws_s3_bucket_public_access_block.access_good_1: Refreshing state... [id=nickmacioce.com-root]
module.s3.module.nickmacioce.aws_s3_bucket_policy.oai-policy: Refreshing state... [id=nickmacioce.com-root]
module.s3.module.nickmacioce.aws_cloudfront_distribution.website_cdn_root: Refreshing state... [id=EWL5EBD36576X]
module.s3.module.isbabymaciocehereyet.aws_route53_record.website_cdn_root_record: Refreshing state... [id=Z04297862RMBF7HTXKRLG_isbabymaciocehereyet.com_A]
module.s3.module.links-nickmacioce.aws_route53_record.website_cdn_root_record: Refreshing state... [id=Z0408742MN1DB2L1IVKL_links.nickmacioce.com_A]
module.s3.module.nickmacioce.aws_route53_record.website_cdn_root_record: Refreshing state... [id=Z0408742MN1DB2L1IVKL_nickmacioce.com_A]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.cloudfront.aws_cloudfront_origin_access_identity.nickmacioce-oai has changed
  ~ resource "aws_cloudfront_origin_access_identity" "nickmacioce-oai" {
      ~ etag                            = "E1CJZP7DX69QT7" -> "E2IMPUZ65VQCM5"
        id                              = "E13B67DH4T3QW9"
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.s3-private-buckets.module.links-nickmacioce.aws_s3_bucket.storage_bucket will be created
  + resource "aws_s3_bucket" "storage_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "macioce-home-k8s-longhorn-backups"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.s3-private-buckets.module.links-nickmacioce.aws_s3_bucket_public_access_block.access_good_1 will be created
  + resource "aws_s3_bucket_public_access_block" "access_good_1" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
``````

</details>


*Pusher: @ndmacioce, Action: `pull_request`*